# Import wymaganych pakiet√≥w

In [1]:
import numpy as np
import pandas as pd

# Wczytanie pliku

In [2]:
df = pd.read_csv("Zbi√≥r danych Titanic.arff.txt", header = 0, na_values = "?")
df.head(20)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
10,1,0,"Astor, Col. John Jacob",male,47.0000,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0000,1,0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
12,1,1,"Aubart, Mme. Leontine Pauline",female,24.0000,0,0,PC 17477,69.3000,B35,C,9,NaN,"Paris, France"
13,1,1,"Barber, Miss. Ellen 'Nellie'",female,26.0000,0,0,19877,78.8500,NaN,S,6,NaN,NaN
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0000,0,0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
15,1,0,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
16,1,0,"Baxter, Mr. Quigg Edmond",male,24.0000,0,1,PC 17558,247.5208,B58 B60,C,NaN,NaN,"Montreal, PQ"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0000,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
18,1,1,"Bazzani, Miss. Albina",female,32.0000,0,0,11813,76.2917,D15,C,8,NaN,NaN
19,1,0,"Beattie, Mr. Thomson",male,36.0000,0,0,13050,75.2417,C6,C,A,NaN,"Winnipeg, MN"

<b>Ilo≈õƒá warto≈õci brakujƒÖcych w danych kolumnach:</b>

In [3]:
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

<b>Procentowy udzia≈Ç warto≈õci brakujƒÖcych:</b>

In [4]:
df.isnull().mean() * 100

pclass        0.000000
survived      0.000000
name          0.000000
sex           0.000000
age          20.091673
sibsp         0.000000
parch         0.000000
ticket        0.000000
fare          0.076394
cabin        77.463713
embarked      0.152788
boat         62.872422
body         90.756303
home.dest    43.086325
dtype: float64

Warto≈õci brakujƒÖce majƒÖ widoczny udzia≈Ç dla kolumn: <b>age</b>, <b>cabin</b>, <b>boat</b>, <b>body</b>, <b>home.dest</b>

<b>Ilo≈õƒá cech:</b>

In [5]:
len(df.columns)

14

Zbi√≥r zawiera 14 cech:
- <b>pclass</b> - klasa, kt√≥rƒÖ podro≈ºowa≈Ç dany pasa≈ºer
- <b>survived</b> - 0 = zginƒÖ≈Ç w katastrofie; 1 = prze≈ºy≈Ç
- <b>name</b> - dane osobowe pasa≈ºera
- <b>sex</b> - p≈Çeƒá
- <b>age</b> - wiek
- <b>sibsp</b> - ilo≈õƒá rodze≈Ñstwa lub ma≈Ç≈ºonk√≥w danego pasa≈ºera na pog≈Çadzie
- <b>parch</b> - ilo≈õƒá rodzic√≥w i dzieci danego pasa≈ºera na pok≈Çadzie
- <b>ticket</b> - nr biletu
- <b>fare</b> - op≈Çata za podr√≥≈º
- <b>cabin</b> - nr kabiny
- <b>embarked</b> - port, w kt√≥rym pasa≈ºer wsiad≈Ç (S - Southampton, C - Cherbourg, Q - Queenstown)
- <b>boat</b> - oznaczenie ≈Çodzi ratunkowej, do kt√≥rej wsiad≈Ç pasa≈ºer
- <b>body</b> - nr identyfikacyjny cia≈Ça (je≈õli zginƒÖ≈Ç w katastrofie i uda≈Ço siƒô odnale≈∫ƒá cia≈Ço)
- <b>home.dest</b> - miejsce zamieszkania lub cel podr√≥≈ºy

Ju≈º na pierwszy rzut oka mo≈ºna zauwa≈ºyƒá sporo warto≈õci NaN w kolumnach body i boat, co jest zrozumia≈Çe, gdy≈º najczƒô≈õciej brakuje ich dla pasa≈ºer√≥w, kt√≥rzy zginƒôli w katastrofie (nie zdƒÖ≈ºyli wsiƒÖ≈õƒá na ≈Ç√≥d≈∫ ratunkowƒÖ, nie uda≈Ço siƒô znale≈∫ƒá ich cia≈Ç)

Mo≈ºna r√≥wnie≈º dostrzec powtarzajƒÖce siƒô warto≈õci w kolumnach: <b>ticket, fare, czy te≈º cabin</b>

Przed u≈ºyciem funkcji <b>isnull()</b> nale≈ºa≈Ço przy wczytaniu ustaliƒá, ≈ºe warto≈õci NA w zbiorze danych sƒÖ oznaczone przez znaki zapytania (normalnie za warto≈õci NA uznaje siƒô po prostu puste pola)

<b>Dla upewnienia siƒô, ≈ºe warto≈õci brakujƒÖce nie by≈Çy oznaczone w inny spos√≥b:</b>

In [6]:
df.isnull().sum() + df.notnull().sum() == len(df)

pclass       True
survived     True
name         True
sex          True
age          True
sibsp        True
parch        True
ticket       True
fare         True
cabin        True
embarked     True
boat         True
body         True
home.dest    True
dtype: bool

Mo≈ºemy stworzyƒá zmiennƒÖ kategorycznƒÖ, np. dla zmiennej <b>body</b>, kt√≥ra poinformuje nas o warto≈õci brakujƒÖcej.
Dodatkowo mo≈ºemy u≈ºyƒá operacji <b>groupby</b>, aby zmapowaƒá brakujƒÖce warto≈õci danej kolumny i powiƒÖzanie z warto≈õciƒÖ <b>survived</b> (0 lub 1)

In [7]:
df['BodyNull'] = np.where(df['body'].isnull(), 1, 0)
df.groupby(['survived'])['BodyNull'].mean()

survived
0    0.850433
1    1.000000
Name: BodyNull, dtype: float64

In [8]:
#to samo w jednej linijce
df.groupby(['survived'])['body'].apply(lambda x: np.where(x.isnull(), 1, 0).mean())

survived
0    0.850433
1    1.000000
Name: body, dtype: float64

In [9]:
df.head(10)[['survived', 'body','BodyNull']]

   survived   body  BodyNull
0         1    NaN         1
1         1    NaN         1
2         0    NaN         1
3         0  135.0         0
4         0    NaN         1
5         1    NaN         1
6         1    NaN         1
7         0    NaN         1
8         1    NaN         1
9         0   22.0         0

Operacja ta pozwoli≈Ça nam zobaczyƒá jaki jest odsetek brakujƒÖcej warto≈õci zmiennej <b>body</b> w zale≈ºno≈õci czy kto≈õ prze≈ºy≈Ç katastrofƒô.

Dochodzimy do oczywistego wniosku, ≈ºe dla tych, kt√≥rzy prze≈ºyli, warto≈õci brakujƒÖce body majƒÖ 100% udzia≈Çu w tej grupie (nie szukano i identyfikowano cia≈Ç ocala≈Çych).

Dla tych, kt√≥rzy zginƒôli udzia≈Ç ten jednak te≈º jest bardzo du≈ºy (85%), co oznacza, ≈ºe nie odnaleziono i zidentyfikowano a≈º 85% cia≈Ç ofiar.

Mo≈ºemy zrobiƒá takie mapowanie wed≈Çug zmiennej survived dla wszystkich zmiennych, dla kt√≥rych przedtem zauwa≈ºyli≈õmy znaczny udzia≈Ç warto≈õci brakujƒÖcych:

In [10]:
#dla czytelno≈õci pokazujƒô z dok≈Çadno≈õciƒÖ do 2 miejsc po przecinku
df.groupby(["survived"])[['boat', 'body', 'home.dest', 'age', 'cabin']].apply(lambda x: x.isnull().mean()).style.format(precision = 2)

Albo te≈º pogrupowaƒá wed≈Çug innej zmiennej, np. <b>pclass</b>

In [11]:
df.groupby("pclass")[['boat', 'body', 'home.dest', 'age', 'cabin']].apply(lambda x: x.isnull().mean()).style.format(precision = 2)

Mo≈ºna p√≥j≈õƒá jeszcze krok dalej i pogrupowaƒá wed≈Çug obu tych zmiennych:

In [12]:
df.groupby(["survived", "pclass"])[['boat', 'body', 'home.dest', 'age', 'cabin']].apply(lambda x: x.isnull().mean()).style.format(precision = 2)

<b>Na podstawie analizy powy≈ºszych tabel mo≈ºna doj≈õƒá do wniosk√≥w:</b>
- dla zmiennych <b>home.dest, age i cabin</b> rozk≈Çad udzia≈Çu warto≈õci brakujƒÖcych wed≈Çug klasy jest niezale≈ºny od tego czy pasa≈ºerowie prze≈ºyli katastrofƒô
- warto≈õci brakujƒÖce dla <b>home.dest</b> sƒÖ wyra≈∫nie zale≈ºne od klasy (najwiƒôcej dla 3). Nieznacznie wy≈ºszy udzia≈Ç warto≈õci NA dla zmiennej home.dest przy grupowaniu wed≈Çug survived dla zmar≈Çych mo≈ºe byƒá zwiƒÖzany z tym, ≈ºe wiƒôkszo≈õƒá ofiar katastrofy to pasa≈ºerowie 3 klasy (sprawdzenie poni≈ºej)
- warto≈õci NA dla zmiennej <b>boat</b> sƒÖ jednoznacznie zale≈ºne od tego czy kto≈õ prze≈ºy≈Ç katastrofƒô (NA zwiƒÖzane ze ≈õmierciƒÖ)
- warto≈õci NA dla <b>age</b> nie sƒÖ wyra≈∫nie zale≈ºne od ≈ºadnej ze zmiennych, wed≈Çug kt√≥rych grupowali≈õmy
- warto≈õci NA dla zmiennej <b>body</b> nie wystƒôpujƒÖ je≈õli kto≈õ prze≈ºy≈Ç katastrofƒô (oczywiste - nie szukano i identyfikowano cia≈Ç ocala≈Çych). Dla zmar≈Çych jednak tak≈ºe jest on niezale≈ºny od klasy (bardzo wysokie udzia≈Çy procentowe warto≈õci brakujƒÖcych w ka≈ºdej)

In [13]:
# ilo≈õƒá ofiar wed≈Çug klasy
df[df['survived'] == 0]['pclass'].value_counts()

pclass
3    528
2    158
1    123
Name: count, dtype: int64

<b>Podsumowanie:</b>
- mo≈ºemy usunƒÖƒá warto≈õci brakujƒÖce z kolumn <b>fare i embarked</b> - ze wzglƒôdu na ma≈ÇƒÖ ilo≈õƒá zak≈Çadamy, ≈ºe sƒÖ to warto≈õci typu <b>MCAR</b>
- warto≈õci brakujƒÖce typu <b>MAR</b> - <b>boat, body</b> (zale≈ºne, przynajmniej czƒô≈õciowo, od survived), <b>cabin, home.dest</b> (zale≈ºne od klasy).
Do tej grupy zaliczymy te≈º <b>age</b>, poniewa≈º brakujƒÖce warto≈õci w tej kolumnie sƒÖ zwiƒÖzane z brakami np. w cabin (pokazane poni≈ºej)
Kolumnƒô boat w zasadzie w ca≈Ço≈õci mo≈ºna usunƒÖƒá ze zbioru (brak nowej informacji - bardzo silne powiƒÖzanie z survived).
Innych danych brakujƒÖcych ze wzglƒôdu na du≈ºƒÖ ilo≈õƒá nie mo≈ºna po prostu usunƒÖƒá. RozwiƒÖzaniem jest np. wype≈Çnienie brak√≥w (imputacja).

In [14]:
# odsetek brakujƒÖcych warto≈õci dla innych zmiennych, gdy warto≈õci brakuje dla age
df[df['age'].isnull()].isnull().mean()

pclass       0.000000
survived     0.000000
name         0.000000
sex          0.000000
age          1.000000
sibsp        0.000000
parch        0.000000
ticket       0.000000
fare         0.000000
cabin        0.912548
embarked     0.000000
boat         0.737643
body         0.996198
home.dest    0.771863
BodyNull     0.000000
dtype: float64

In [15]:
# odsetek warto≈õci not-null dla innych zmiennych, gdy warto≈õci brakuje dla age
df[df['age'].isnull()].notnull().mean()

pclass       1.000000
survived     1.000000
name         1.000000
sex          1.000000
age          0.000000
sibsp        1.000000
parch        1.000000
ticket       1.000000
fare         1.000000
cabin        0.087452
embarked     1.000000
boat         0.262357
body         0.003802
home.dest    0.228137
BodyNull     1.000000
dtype: float64